Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00/include/component/hsm.h
/* -------- HSM_INTFLAG : (HSM Offset: 0x10) (R/W 32) INTERRUPT FLAG -------- */
#define HSM_INTFLAG_RESETVALUE                _UINT32_(0x00)                                       /*  (HSM_INTFLAG) INTERRUPT FLAG  Reset Value */

#define HSM_INTFLAG_ERROR_Pos                 _UINT32_(0)                                          /* (HSM_INTFLAG) Error Interrupt Flag Position */
#define HSM_INTFLAG_ERROR_Msk                 (_UINT32_(0x1) << HSM_INTFLAG_ERROR_Pos)             /* (HSM_INTFLAG) Error Interrupt Flag Mask */
#define HSM_INTFLAG_ERROR(value)              (HSM_INTFLAG_ERROR_Msk & (_UINT32_(value) << HSM_INTFLAG_ERROR_Pos)) /* Assigment of value for ERROR in the HSM_INTFLAG register */
#define HSM_INTFLAG_TAMPER_Pos                _UINT32_(1)                                          /* (HSM_INTFLAG) Tamper Interrupt Flag Position */
#define HSM_INTFLAG_TAMPER_Msk                (_UINT32_(0x1) << HSM_INTFLAG_TAMPER_Pos)            /* (HSM_INTFLAG) Tamper Interrupt Flag Mask */
#define HSM_INTFLAG_TAMPER(value)             (HSM_INTFLAG_TAMPER_Msk & (_UINT32_(value) << HSM_INTFLAG_TAMPER_Pos)) /* Assigment of value for TAMPER in the HSM_INTFLAG register */
#define HSM_INTFLAG_Msk                       _UINT32_(0x00000003)                                 /* (HSM_INTFLAG) Register Mask  */


/* -------- HSM_MBCONFIG : (HSM Offset: 0x158) (R/W 32) MAILBOX CONFIGURATION -------- */
#define HSM_MBCONFIG_RESETVALUE               _UINT32_(0x00)                                       /*  (HSM_MBCONFIG) MAILBOX CONFIGURATION  Reset Value */

#define HSM_MBCONFIG_TXINT_Pos                _UINT32_(0)                                          /* (HSM_MBCONFIG) MAILBOX TRANSMIT INTERRUPT ENABLE Position */
#define HSM_MBCONFIG_TXINT_Msk                (_UINT32_(0x1) << HSM_MBCONFIG_TXINT_Pos)            /* (HSM_MBCONFIG) MAILBOX TRANSMIT INTERRUPT ENABLE Mask */
#define HSM_MBCONFIG_TXINT(value)             (HSM_MBCONFIG_TXINT_Msk & (_UINT32_(value) << HSM_MBCONFIG_TXINT_Pos)) /* Assigment of value for TXINT in the HSM_MBCONFIG register */
#define HSM_MBCONFIG_RXINT_Pos                _UINT32_(1)                                          /* (HSM_MBCONFIG) MAILBOX RECEIVE INTERRUPT ENABLE Position */
#define HSM_MBCONFIG_RXINT_Msk                (_UINT32_(0x1) << HSM_MBCONFIG_RXINT_Pos)            /* (HSM_MBCONFIG) MAILBOX RECEIVE INTERRUPT ENABLE Mask */
#define HSM_MBCONFIG_RXINT(value)             (HSM_MBCONFIG_RXINT_Msk & (_UINT32_(value) << HSM_MBCONFIG_RXINT_Pos)) /* Assigment of value for RXINT in the HSM_MBCONFIG register */
#define HSM_MBCONFIG_Msk                      _UINT32_(0x00000003)                                 /* (HSM_MBCONFIG) Register Mask  */


/* -------- HSM_MBFIFO : (HSM Offset: 0x100) (R/W 32) MAILBOX FIFO -------- */
#define HSM_MBFIFO_RESETVALUE                 _UINT32_(0x00)                                       /*  (HSM_MBFIFO) MAILBOX FIFO  Reset Value */

#define HSM_MBFIFO_MBFIFO_Pos                 _UINT32_(0)                                          /* (HSM_MBFIFO) MAILBOX FIFO Position */
#define HSM_MBFIFO_MBFIFO_Msk                 (_UINT32_(0xFFFFFFFF) << HSM_MBFIFO_MBFIFO_Pos)      /* (HSM_MBFIFO) MAILBOX FIFO Mask */
#define HSM_MBFIFO_MBFIFO(value)              (HSM_MBFIFO_MBFIFO_Msk & (_UINT32_(value) << HSM_MBFIFO_MBFIFO_Pos)) /* Assigment of value for MBFIFO in the HSM_MBFIFO register */
#define HSM_MBFIFO_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (HSM_MBFIFO) Register Mask  */


/* -------- HSM_MBRXHEAD : (HSM Offset: 0x154) (R/W 32) MAILBOX RECEIVE HEADER -------- */
#define HSM_MBRXHEAD_RESETVALUE               _UINT32_(0x00)                                       /*  (HSM_MBRXHEAD) MAILBOX RECEIVE HEADER  Reset Value */

#define HSM_MBRXHEAD_RXHEAD_Pos               _UINT32_(0)                                          /* (HSM_MBRXHEAD) MAILBOX RECEIVE HEADER REGISTER Position */
#define HSM_MBRXHEAD_RXHEAD_Msk               (_UINT32_(0xFFFFFFFF) << HSM_MBRXHEAD_RXHEAD_Pos)    /* (HSM_MBRXHEAD) MAILBOX RECEIVE HEADER REGISTER Mask */
#define HSM_MBRXHEAD_RXHEAD(value)            (HSM_MBRXHEAD_RXHEAD_Msk & (_UINT32_(value) << HSM_MBRXHEAD_RXHEAD_Pos)) /* Assigment of value for RXHEAD in the HSM_MBRXHEAD register */
#define HSM_MBRXHEAD_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (HSM_MBRXHEAD) Register Mask  */


/* -------- HSM_MBRXPROT : (HSM Offset: 0x14C) (R/W 32) MAILBOX RX PROTECTION -------- */
#define HSM_MBRXPROT_RESETVALUE               _UINT32_(0x00)                                       /*  (HSM_MBRXPROT) MAILBOX RX PROTECTION  Reset Value */

#define HSM_MBRXPROT_UNPROT_Pos               _UINT32_(21)                                         /* (HSM_MBRXPROT) MAILBOX UNPROTECTED Position */
#define HSM_MBRXPROT_UNPROT_Msk               (_UINT32_(0x1) << HSM_MBRXPROT_UNPROT_Pos)           /* (HSM_MBRXPROT) MAILBOX UNPROTECTED Mask */
#define HSM_MBRXPROT_UNPROT(value)            (HSM_MBRXPROT_UNPROT_Msk & (_UINT32_(value) << HSM_MBRXPROT_UNPROT_Pos)) /* Assigment of value for UNPROT in the HSM_MBRXPROT register */
#define HSM_MBRXPROT_PRIV_Pos                 _UINT32_(22)                                         /* (HSM_MBRXPROT) MAILBOX MESSAGE PRIVILEDGED ACCESS Position */
#define HSM_MBRXPROT_PRIV_Msk                 (_UINT32_(0x1) << HSM_MBRXPROT_PRIV_Pos)             /* (HSM_MBRXPROT) MAILBOX MESSAGE PRIVILEDGED ACCESS Mask */
#define HSM_MBRXPROT_PRIV(value)              (HSM_MBRXPROT_PRIV_Msk & (_UINT32_(value) << HSM_MBRXPROT_PRIV_Pos)) /* Assigment of value for PRIV in the HSM_MBRXPROT register */
#define HSM_MBRXPROT_NSEC_Pos                 _UINT32_(23)                                         /* (HSM_MBRXPROT) MAILBOX MESSAGE NON-SECURE ACCESS Position */
#define HSM_MBRXPROT_NSEC_Msk                 (_UINT32_(0x1) << HSM_MBRXPROT_NSEC_Pos)             /* (HSM_MBRXPROT) MAILBOX MESSAGE NON-SECURE ACCESS Mask */
#define HSM_MBRXPROT_NSEC(value)              (HSM_MBRXPROT_NSEC_Msk & (_UINT32_(value) << HSM_MBRXPROT_NSEC_Pos)) /* Assigment of value for NSEC in the HSM_MBRXPROT register */
#define HSM_MBRXPROT_USER_Pos                 _UINT32_(24)                                         /* (HSM_MBRXPROT) USER SIDEBAND Position */
#define HSM_MBRXPROT_USER_Msk                 (_UINT32_(0xFF) << HSM_MBRXPROT_USER_Pos)            /* (HSM_MBRXPROT) USER SIDEBAND Mask */
#define HSM_MBRXPROT_USER(value)              (HSM_MBRXPROT_USER_Msk & (_UINT32_(value) << HSM_MBRXPROT_USER_Pos)) /* Assigment of value for USER in the HSM_MBRXPROT register */
#define HSM_MBRXPROT_Msk                      _UINT32_(0xFFE00000)                                 /* (HSM_MBRXPROT) Register Mask  */


/* -------- HSM_MBRXSTATUS : (HSM Offset: 0x144) (R/W 32) MAILBOX RECEIVE STATUS -------- */
#define HSM_MBRXSTATUS_RESETVALUE             _UINT32_(0x200000)                                   /*  (HSM_MBRXSTATUS) MAILBOX RECEIVE STATUS  Reset Value */

#define HSM_MBRXSTATUS_RXREMAINING_Pos        _UINT32_(0)                                          /* (HSM_MBRXSTATUS) RECEIVE BYTES REMAINING Position */
#define HSM_MBRXSTATUS_RXREMAINING_Msk        (_UINT32_(0xFFFF) << HSM_MBRXSTATUS_RXREMAINING_Pos) /* (HSM_MBRXSTATUS) RECEIVE BYTES REMAINING Mask */
#define HSM_MBRXSTATUS_RXREMAINING(value)     (HSM_MBRXSTATUS_RXREMAINING_Msk & (_UINT32_(value) << HSM_MBRXSTATUS_RXREMAINING_Pos)) /* Assigment of value for RXREMAINING in the HSM_MBRXSTATUS register */
#define HSM_MBRXSTATUS_RXTYPE_Pos             _UINT32_(16)                                         /* (HSM_MBRXSTATUS) RECEIVE MESSAGE HEADER TYPE Position */
#define HSM_MBRXSTATUS_RXTYPE_Msk             (_UINT32_(0xF) << HSM_MBRXSTATUS_RXTYPE_Pos)         /* (HSM_MBRXSTATUS) RECEIVE MESSAGE HEADER TYPE Mask */
#define HSM_MBRXSTATUS_RXTYPE(value)          (HSM_MBRXSTATUS_RXTYPE_Msk & (_UINT32_(value) << HSM_MBRXSTATUS_RXTYPE_Pos)) /* Assigment of value for RXTYPE in the HSM_MBRXSTATUS register */
#define HSM_MBRXSTATUS_RXINT_Pos              _UINT32_(20)                                         /* (HSM_MBRXSTATUS) RECEIVE FIFO INTERRUPT FLAG Position */
#define HSM_MBRXSTATUS_RXINT_Msk              (_UINT32_(0x1) << HSM_MBRXSTATUS_RXINT_Pos)          /* (HSM_MBRXSTATUS) RECEIVE FIFO INTERRUPT FLAG Mask */
#define HSM_MBRXSTATUS_RXINT(value)           (HSM_MBRXSTATUS_RXINT_Msk & (_UINT32_(value) << HSM_MBRXSTATUS_RXINT_Pos)) /* Assigment of value for RXINT in the HSM_MBRXSTATUS register */
#define HSM_MBRXSTATUS_RXEMPTY_Pos            _UINT32_(21)                                         /* (HSM_MBRXSTATUS) RECEIVE FIFO FULL Position */
#define HSM_MBRXSTATUS_RXEMPTY_Msk            (_UINT32_(0x1) << HSM_MBRXSTATUS_RXEMPTY_Pos)        /* (HSM_MBRXSTATUS) RECEIVE FIFO FULL Mask */
#define HSM_MBRXSTATUS_RXEMPTY(value)         (HSM_MBRXSTATUS_RXEMPTY_Msk & (_UINT32_(value) << HSM_MBRXSTATUS_RXEMPTY_Pos)) /* Assigment of value for RXEMPTY in the HSM_MBRXSTATUS register */
#define HSM_MBRXSTATUS_RXHEAD_Pos             _UINT32_(22)                                         /* (HSM_MBRXSTATUS) Receive Header Next Word bit Position */
#define HSM_MBRXSTATUS_RXHEAD_Msk             (_UINT32_(0x1) << HSM_MBRXSTATUS_RXHEAD_Pos)         /* (HSM_MBRXSTATUS) Receive Header Next Word bit Mask */
#define HSM_MBRXSTATUS_RXHEAD(value)          (HSM_MBRXSTATUS_RXHEAD_Msk & (_UINT32_(value) << HSM_MBRXSTATUS_RXHEAD_Pos)) /* Assigment of value for RXHEAD in the HSM_MBRXSTATUS register */
#define HSM_MBRXSTATUS_RXERR_Pos              _UINT32_(23)                                         /* (HSM_MBRXSTATUS) RECEIVE ERROR Position */
#define HSM_MBRXSTATUS_RXERR_Msk              (_UINT32_(0x1) << HSM_MBRXSTATUS_RXERR_Pos)          /* (HSM_MBRXSTATUS) RECEIVE ERROR Mask */
#define HSM_MBRXSTATUS_RXERR(value)           (HSM_MBRXSTATUS_RXERR_Msk & (_UINT32_(value) << HSM_MBRXSTATUS_RXERR_Pos)) /* Assigment of value for RXERR in the HSM_MBRXSTATUS register */
#define HSM_MBRXSTATUS_Msk                    _UINT32_(0x00FFFFFF)                                 /* (HSM_MBRXSTATUS) Register Mask  */


/* -------- HSM_MBTXHEAD : (HSM Offset: 0x150) (R/W 32) MAILBOX TRANSMIT HEADER -------- */
#define HSM_MBTXHEAD_RESETVALUE               _UINT32_(0x00)                                       /*  (HSM_MBTXHEAD) MAILBOX TRANSMIT HEADER  Reset Value */

