Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00/include/component/hsm.h
#define HSM_MBTXHEAD_TXHEAD_Pos               _UINT32_(0)                                          /* (HSM_MBTXHEAD) MAILBOX TRANSMIT HEADER REGISTER Position */
#define HSM_MBTXHEAD_TXHEAD_Msk               (_UINT32_(0xFFFFFFFF) << HSM_MBTXHEAD_TXHEAD_Pos)    /* (HSM_MBTXHEAD) MAILBOX TRANSMIT HEADER REGISTER Mask */
#define HSM_MBTXHEAD_TXHEAD(value)            (HSM_MBTXHEAD_TXHEAD_Msk & (_UINT32_(value) << HSM_MBTXHEAD_TXHEAD_Pos)) /* Assigment of value for TXHEAD in the HSM_MBTXHEAD register */
#define HSM_MBTXHEAD_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (HSM_MBTXHEAD) Register Mask  */


/* -------- HSM_MBTXPROT : (HSM Offset: 0x148) (R/W 32) MAILBOX TX PROTECTION -------- */
#define HSM_MBTXPROT_RESETVALUE               _UINT32_(0x00)                                       /*  (HSM_MBTXPROT) MAILBOX TX PROTECTION  Reset Value */

#define HSM_MBTXPROT_UNPROT_Pos               _UINT32_(21)                                         /* (HSM_MBTXPROT) MAILBOX UNPROTECTED Position */
#define HSM_MBTXPROT_UNPROT_Msk               (_UINT32_(0x1) << HSM_MBTXPROT_UNPROT_Pos)           /* (HSM_MBTXPROT) MAILBOX UNPROTECTED Mask */
#define HSM_MBTXPROT_UNPROT(value)            (HSM_MBTXPROT_UNPROT_Msk & (_UINT32_(value) << HSM_MBTXPROT_UNPROT_Pos)) /* Assigment of value for UNPROT in the HSM_MBTXPROT register */
#define HSM_MBTXPROT_PRIV_Pos                 _UINT32_(22)                                         /* (HSM_MBTXPROT) MAILBOX MESSAGE PRIVILEDGED ACCESS Position */
#define HSM_MBTXPROT_PRIV_Msk                 (_UINT32_(0x1) << HSM_MBTXPROT_PRIV_Pos)             /* (HSM_MBTXPROT) MAILBOX MESSAGE PRIVILEDGED ACCESS Mask */
#define HSM_MBTXPROT_PRIV(value)              (HSM_MBTXPROT_PRIV_Msk & (_UINT32_(value) << HSM_MBTXPROT_PRIV_Pos)) /* Assigment of value for PRIV in the HSM_MBTXPROT register */
#define HSM_MBTXPROT_NSEC_Pos                 _UINT32_(23)                                         /* (HSM_MBTXPROT) MAILBOX MESSAGE NON-SECURE ACCESS Position */
#define HSM_MBTXPROT_NSEC_Msk                 (_UINT32_(0x1) << HSM_MBTXPROT_NSEC_Pos)             /* (HSM_MBTXPROT) MAILBOX MESSAGE NON-SECURE ACCESS Mask */
#define HSM_MBTXPROT_NSEC(value)              (HSM_MBTXPROT_NSEC_Msk & (_UINT32_(value) << HSM_MBTXPROT_NSEC_Pos)) /* Assigment of value for NSEC in the HSM_MBTXPROT register */
#define HSM_MBTXPROT_USER_Pos                 _UINT32_(24)                                         /* (HSM_MBTXPROT) USER SIDEBAND Position */
#define HSM_MBTXPROT_USER_Msk                 (_UINT32_(0xFF) << HSM_MBTXPROT_USER_Pos)            /* (HSM_MBTXPROT) USER SIDEBAND Mask */
#define HSM_MBTXPROT_USER(value)              (HSM_MBTXPROT_USER_Msk & (_UINT32_(value) << HSM_MBTXPROT_USER_Pos)) /* Assigment of value for USER in the HSM_MBTXPROT register */
#define HSM_MBTXPROT_Msk                      _UINT32_(0xFFE00000)                                 /* (HSM_MBTXPROT) Register Mask  */


/* -------- HSM_MBTXSTATUS : (HSM Offset: 0x140) (R/W 32) MAILBOX TRANSMIT STATUS -------- */
#define HSM_MBTXSTATUS_RESETVALUE             _UINT32_(0x100000)                                   /*  (HSM_MBTXSTATUS) MAILBOX TRANSMIT STATUS  Reset Value */

#define HSM_MBTXSTATUS_TXREMAINING_Pos        _UINT32_(0)                                          /* (HSM_MBTXSTATUS) TRANSMIT BYTES REMAINING Position */
#define HSM_MBTXSTATUS_TXREMAINING_Msk        (_UINT32_(0xFFFF) << HSM_MBTXSTATUS_TXREMAINING_Pos) /* (HSM_MBTXSTATUS) TRANSMIT BYTES REMAINING Mask */
#define HSM_MBTXSTATUS_TXREMAINING(value)     (HSM_MBTXSTATUS_TXREMAINING_Msk & (_UINT32_(value) << HSM_MBTXSTATUS_TXREMAINING_Pos)) /* Assigment of value for TXREMAINING in the HSM_MBTXSTATUS register */
#define HSM_MBTXSTATUS_TXTYPE_Pos             _UINT32_(16)                                         /* (HSM_MBTXSTATUS) TRANSMIT MESSAGE HEADER TYPE Position */
#define HSM_MBTXSTATUS_TXTYPE_Msk             (_UINT32_(0xF) << HSM_MBTXSTATUS_TXTYPE_Pos)         /* (HSM_MBTXSTATUS) TRANSMIT MESSAGE HEADER TYPE Mask */
#define HSM_MBTXSTATUS_TXTYPE(value)          (HSM_MBTXSTATUS_TXTYPE_Msk & (_UINT32_(value) << HSM_MBTXSTATUS_TXTYPE_Pos)) /* Assigment of value for TXTYPE in the HSM_MBTXSTATUS register */
#define HSM_MBTXSTATUS_TXINT_Pos              _UINT32_(20)                                         /* (HSM_MBTXSTATUS) TRANSMIT FIFO INTERRUPT FLAG Position */
#define HSM_MBTXSTATUS_TXINT_Msk              (_UINT32_(0x1) << HSM_MBTXSTATUS_TXINT_Pos)          /* (HSM_MBTXSTATUS) TRANSMIT FIFO INTERRUPT FLAG Mask */
#define HSM_MBTXSTATUS_TXINT(value)           (HSM_MBTXSTATUS_TXINT_Msk & (_UINT32_(value) << HSM_MBTXSTATUS_TXINT_Pos)) /* Assigment of value for TXINT in the HSM_MBTXSTATUS register */
#define HSM_MBTXSTATUS_TXFULL_Pos             _UINT32_(21)                                         /* (HSM_MBTXSTATUS) TRANSMIT FIFO FULL Position */
#define HSM_MBTXSTATUS_TXFULL_Msk             (_UINT32_(0x1) << HSM_MBTXSTATUS_TXFULL_Pos)         /* (HSM_MBTXSTATUS) TRANSMIT FIFO FULL Mask */
#define HSM_MBTXSTATUS_TXFULL(value)          (HSM_MBTXSTATUS_TXFULL_Msk & (_UINT32_(value) << HSM_MBTXSTATUS_TXFULL_Pos)) /* Assigment of value for TXFULL in the HSM_MBTXSTATUS register */
#define HSM_MBTXSTATUS_TXERR_Pos              _UINT32_(23)                                         /* (HSM_MBTXSTATUS) TRANSMIT ERROR Position */
#define HSM_MBTXSTATUS_TXERR_Msk              (_UINT32_(0x1) << HSM_MBTXSTATUS_TXERR_Pos)          /* (HSM_MBTXSTATUS) TRANSMIT ERROR Mask */
#define HSM_MBTXSTATUS_TXERR(value)           (HSM_MBTXSTATUS_TXERR_Msk & (_UINT32_(value) << HSM_MBTXSTATUS_TXERR_Pos)) /* Assigment of value for TXERR in the HSM_MBTXSTATUS register */
#define HSM_MBTXSTATUS_Msk                    _UINT32_(0x00BFFFFF)                                 /* (HSM_MBTXSTATUS) Register Mask  */


/* -------- HSM_STATUS : (HSM Offset: 0x14) (R/W 32) STATUS -------- */
#define HSM_STATUS_RESETVALUE                 _UINT32_(0x00)                                       /*  (HSM_STATUS) STATUS  Reset Value */

#define HSM_STATUS_BUSY_Pos                   _UINT32_(0)                                          /* (HSM_STATUS) HSM CPU BUSY Position */
#define HSM_STATUS_BUSY_Msk                   (_UINT32_(0x1) << HSM_STATUS_BUSY_Pos)               /* (HSM_STATUS) HSM CPU BUSY Mask */
#define HSM_STATUS_BUSY(value)                (HSM_STATUS_BUSY_Msk & (_UINT32_(value) << HSM_STATUS_BUSY_Pos)) /* Assigment of value for BUSY in the HSM_STATUS register */
#define HSM_STATUS_LKUP_Pos                   _UINT32_(1)                                          /* (HSM_STATUS) HSM CPU LOCKUP Position */
#define HSM_STATUS_LKUP_Msk                   (_UINT32_(0x1) << HSM_STATUS_LKUP_Pos)               /* (HSM_STATUS) HSM CPU LOCKUP Mask */
#define HSM_STATUS_LKUP(value)                (HSM_STATUS_LKUP_Msk & (_UINT32_(value) << HSM_STATUS_LKUP_Pos)) /* Assigment of value for LKUP in the HSM_STATUS register */
#define HSM_STATUS_PS_Pos                     _UINT32_(4)                                          /* (HSM_STATUS) PROCESSING STATE Position */
#define HSM_STATUS_PS_Msk                     (_UINT32_(0x7) << HSM_STATUS_PS_Pos)                 /* (HSM_STATUS) PROCESSING STATE Mask */
#define HSM_STATUS_PS(value)                  (HSM_STATUS_PS_Msk & (_UINT32_(value) << HSM_STATUS_PS_Pos)) /* Assigment of value for PS in the HSM_STATUS register */
#define HSM_STATUS_LCS_Pos                    _UINT32_(8)                                          /* (HSM_STATUS) LIFECYCLE STATE Position */
#define HSM_STATUS_LCS_Msk                    (_UINT32_(0x7) << HSM_STATUS_LCS_Pos)                /* (HSM_STATUS) LIFECYCLE STATE Mask */
#define HSM_STATUS_LCS(value)                 (HSM_STATUS_LCS_Msk & (_UINT32_(value) << HSM_STATUS_LCS_Pos)) /* Assigment of value for LCS in the HSM_STATUS register */
#define HSM_STATUS_SBS_Pos                    _UINT32_(12)                                         /* (HSM_STATUS) SECURE BOOT STATE Position */
#define HSM_STATUS_SBS_Msk                    (_UINT32_(0x7) << HSM_STATUS_SBS_Pos)                /* (HSM_STATUS) SECURE BOOT STATE Mask */
#define HSM_STATUS_SBS(value)                 (HSM_STATUS_SBS_Msk & (_UINT32_(value) << HSM_STATUS_SBS_Pos)) /* Assigment of value for SBS in the HSM_STATUS register */
#define HSM_STATUS_ECODE_Pos                  _UINT32_(16)                                         /* (HSM_STATUS) ERROR CODE Position */
#define HSM_STATUS_ECODE_Msk                  (_UINT32_(0xF) << HSM_STATUS_ECODE_Pos)              /* (HSM_STATUS) ERROR CODE Mask */
#define HSM_STATUS_ECODE(value)               (HSM_STATUS_ECODE_Msk & (_UINT32_(value) << HSM_STATUS_ECODE_Pos)) /* Assigment of value for ECODE in the HSM_STATUS register */
#define HSM_STATUS_Msk                        _UINT32_(0x000F7773)                                 /* (HSM_STATUS) Register Mask  */


/** \brief HSM register offsets definitions */
#define HSM_CTRLA_REG_OFST             _UINT32_(0x00)      /* (HSM_CTRLA) CONTROL REGISTER A Offset */
#define HSM_CTRLB_REG_OFST             _UINT32_(0x04)      /* (HSM_CTRLB) CONTROL REGISTER B Offset */
#define HSM_INTENCLR_REG_OFST          _UINT32_(0x08)      /* (HSM_INTENCLR) INTERRUPT ENABLE CLEAR REGISTER Offset */
#define HSM_INTENSET_REG_OFST          _UINT32_(0x0C)      /* (HSM_INTENSET) INTERRUPT ENABLE SET Offset */
#define HSM_INTFLAG_REG_OFST           _UINT32_(0x10)      /* (HSM_INTFLAG) INTERRUPT FLAG Offset */
#define HSM_MBCONFIG_REG_OFST          _UINT32_(0x158)     /* (HSM_MBCONFIG) MAILBOX CONFIGURATION Offset */
#define HSM_MBFIFO_REG_OFST            _UINT32_(0x100)     /* (HSM_MBFIFO) MAILBOX FIFO Offset */
#define HSM_MBFIFO0_REG_OFST           _UINT32_(0x100)     /* (HSM_MBFIFO0) MAILBOX FIFO Offset */
#define HSM_MBFIFO1_REG_OFST           _UINT32_(0x104)     /* (HSM_MBFIFO1) MAILBOX FIFO Offset */
#define HSM_MBFIFO2_REG_OFST           _UINT32_(0x108)     /* (HSM_MBFIFO2) MAILBOX FIFO Offset */
#define HSM_MBFIFO3_REG_OFST           _UINT32_(0x10C)     /* (HSM_MBFIFO3) MAILBOX FIFO Offset */
#define HSM_MBFIFO4_REG_OFST           _UINT32_(0x110)     /* (HSM_MBFIFO4) MAILBOX FIFO Offset */
#define HSM_MBFIFO5_REG_OFST           _UINT32_(0x114)     /* (HSM_MBFIFO5) MAILBOX FIFO Offset */
#define HSM_MBFIFO6_REG_OFST           _UINT32_(0x118)     /* (HSM_MBFIFO6) MAILBOX FIFO Offset */
#define HSM_MBFIFO7_REG_OFST           _UINT32_(0x11C)     /* (HSM_MBFIFO7) MAILBOX FIFO Offset */
#define HSM_MBFIFO8_REG_OFST           _UINT32_(0x120)     /* (HSM_MBFIFO8) MAILBOX FIFO Offset */
#define HSM_MBFIFO9_REG_OFST           _UINT32_(0x124)     /* (HSM_MBFIFO9) MAILBOX FIFO Offset */
#define HSM_MBFIFO10_REG_OFST          _UINT32_(0x128)     /* (HSM_MBFIFO10) MAILBOX FIFO Offset */
#define HSM_MBFIFO11_REG_OFST          _UINT32_(0x12C)     /* (HSM_MBFIFO11) MAILBOX FIFO Offset */
#define HSM_MBFIFO12_REG_OFST          _UINT32_(0x130)     /* (HSM_MBFIFO12) MAILBOX FIFO Offset */
#define HSM_MBFIFO13_REG_OFST          _UINT32_(0x134)     /* (HSM_MBFIFO13) MAILBOX FIFO Offset */
#define HSM_MBFIFO14_REG_OFST          _UINT32_(0x138)     /* (HSM_MBFIFO14) MAILBOX FIFO Offset */
#define HSM_MBFIFO15_REG_OFST          _UINT32_(0x13C)     /* (HSM_MBFIFO15) MAILBOX FIFO Offset */
#define HSM_MBRXHEAD_REG_OFST          _UINT32_(0x154)     /* (HSM_MBRXHEAD) MAILBOX RECEIVE HEADER Offset */
#define HSM_MBRXPROT_REG_OFST          _UINT32_(0x14C)     /* (HSM_MBRXPROT) MAILBOX RX PROTECTION Offset */
#define HSM_MBRXSTATUS_REG_OFST        _UINT32_(0x144)     /* (HSM_MBRXSTATUS) MAILBOX RECEIVE STATUS Offset */
#define HSM_MBTXHEAD_REG_OFST          _UINT32_(0x150)     /* (HSM_MBTXHEAD) MAILBOX TRANSMIT HEADER Offset */
#define HSM_MBTXPROT_REG_OFST          _UINT32_(0x148)     /* (HSM_MBTXPROT) MAILBOX TX PROTECTION Offset */
#define HSM_MBTXSTATUS_REG_OFST        _UINT32_(0x140)     /* (HSM_MBTXSTATUS) MAILBOX TRANSMIT STATUS Offset */
#define HSM_STATUS_REG_OFST            _UINT32_(0x14)      /* (HSM_STATUS) STATUS Offset */

